#=====================================
#========Python Introduction==========
#=====================================

# Python is script language
# The difference between low level & high level
   #Low level
      # ارسال البيانات على شكل احاد واصفار
      # سريعة جدا  لاننا نتحدث مع الكمبيوتر بشكل مباشر
      # اللغة  سهلة التنفيذ
      # صعب تتبرمج لان اللغة كالها احاد واصفار
      # البرنامج يشتغل الكمبيوتر الشحصي ولااستطيع نقله لكمبيوتر اخر
      #  c , Assembly
      
    #High level
      # سهلة جدا لان طريقة كتابتها شبيهه بالانجليزي ولغة الانسان
      # كتابة الكود يأخذ وقت اقل
      # سهلة في معاجلة المشكلت ان وجدت
      # استطيع نقلالبرنامج لاي كمبيوتر بسهولة
      # C# , python , js , java
# -----------------------------------------------------------
# The difference between Interpreter & Compilar
    # Interpreter
      # في حالة وجود خطأ يتوقف البرنامج ولا ينظر للاكواد التي تحت حتى ان كانت صحيحة
      # Js , Python ,Java
    # Compilar
      # يقرأ جميع الاكواد من الى تحت وينفذ البرنامج ويعطينا الاخطائ ان وجدت
# ------------------------------------------------------------

















